Уважаемый {login}, <br />
Это письмо отправлено с сайта {host} <br />
 <br />
Вы получили это письмо, так как этот e-mail адрес был использован при регистрации на сайте. Если Вы не регистрировались на этом сайте, просто проигнорируйте это письмо и удалите его. Вы больше не получите такого письма. <br />
 <br />
------------------------------------------------ <br />
Ваш логин и пароль на сайте: <br />
------------------------------------------------ <br />
 <br />
Логин: {login} <br />
Пароль: {password} <br />
 <br />
------------------------------------------------ <br />
Инструкция по активации <br />
------------------------------------------------ <br />
 <br />
Благодарим Вас за регистрацию. <br />
Мы требуем от Вас подтверждения Вашей регистрации, для проверки того, что введённый Вами e-mail адрес - реальный. Это требуется для защиты от нежелательных злоупотреблений и спама. <br />
 <br />
Для активации Вашего аккаунта, зайдите по следующей ссылке: <br />
 <br />
{link} <br />
 <br />
Если и при этих действиях ничего не получилось, возможно Ваш аккаунт удалён. В этом случае, обратитесь к Администратору, для разрешения проблемы. <br />
 <br />
С уважением, <br />
Администрация {host} .