<div class="news">
<style>
    .news {
	width:100% !important;
    }
    .news-header, .news-content, .news-footer{
	width:100% !important;
	background-size: 100%;
    }
    </style>
    <header class="news-header">
		[img]<div class="img" style="background-image: url({img})">[/img]
		    <div class="date"><span>{day}</span>/{month}/{year}</div>
		    <div class="title">{ntitle}</div>
		</div>
	    </header><section class="news-content">
              <div class="content">{newsfull}
</div>																																																																																																																																																																																																																																																																						<div style="display:none;">Онлайн игры, будь то клиентские или браузерные, всегда пользуются большей популярностью чем обычные компьютерные игры, поэтому наш сайт <a href="http://darkrealm.su/">лучшие онлайн игры</a> знакомит вас только с теми развлекательными проектами, которые достойны вашего внимания, в которые увлекут в мир фантазий надолго.</div>	<div style="display:none;"> Являясь начинающим веб мастером, каждый хоть раз делал игровой сайт, но самое трудно было подобрать игровой шаблон, поэтому мы решили снабдить таких новичков и собрали огромную коллекцию <a href="http://l2design.ru/">бесплатных игровых шаблонов</a>, теперь работая над своим игровым порталом, не встанет задачи в поиске игрового шаблона, доствточно будет зайти к нам и бесплатно скачать любой игравой шаблон.</div>	<div style="display:none;">Найти поздравления для любимого друга или подруги, всегда является трудной задачей на которую тратится много времени, но есть выход из этой ситуации и находится он на сайте <a href="http://pozhelanya.ru">красивых поздравлений и пожеланий</a>, приходите и выбирайте красивые поздравления на различные праздники и пусть они порадуют ваших близких теплым словом.</div>	<div style="display:none;">трудность готовки блюд заключается в наличии продуктов в вашем холодильнке. Находя понравившийся рецепт, к сожалению, обнаруживаешь отсутствие того или иного ингридиента. Можем рассказать секрет, как быстро приготовить обед и не заморачиваться с наличием продуктов, переходите по ссылке: <a href="http://crazy-cookery.ru/">необыкновенная кулинария</a> и вы с удивлением там обнаружите множество различных рецептов из доступных продуктов, которые есть на кухне, практически, любой хозяйки и теперь приготовление вкусного блюда не поставит вас в тупик.</div>																																																																																																																					
		</section>
           <footer class="news-footer">
              <div class="info">
           <ul>
                  <li>Share: &nbsp;</li>
                  <li><a href="/" class="ico vk"></a></li>
                  <li><a href="/" class="ico fb"></a></li>
                  <li><a href="/" class="ico tw"></a></li>
                </ul>
                <div class="clear"></div>
              </div>
            </footer>
            </div>